app/controllers/movies_controller.rb

  def show
    @movie = Movie.find(params[:id])
---
SELECT * FROM `movies` WHERE (`movies`.`id` = 1)

  def create
    @movie = Movie.new(params[:movie])

    respond_to do |format|
      if @movie.save
---
INSERT INTO `movies` (`rating`, `updated_at`, `title`, `created_at`) VALUES(3, '2009-09-17 06:25:24', 'asdg', '2009-09-17 06:25:24')