app/controllers/resources_controller.rb

SELECT * FROM `resources`
---
  def index
    @resources = Resource.all

SELECT * FROM `resources` WHERE (`resources`.`id` = 1)
---
  def show
    @resource = Resource.find(params[:id])

SELECT * FROM `resources` WHERE (`resources`.`id` = 1)
---
  def edit
    @resource = Resource.find(params[:id])

INSERT INTO `resources` (`rating`, `resource_type`, `updated_at`, `title`, `desc`, `avatar`, `created_at`) VALUES(2, 'music', '2009-09-17 09:22:43', 'music2', '', '', '2009-09-17 09:22:43')
---
  def create
    @resource = Resource.new(params[:resource])

    respond_to do |format|
      if @resource.save

SELECT * FROM `resources` WHERE (`resources`.`id` = 1)
UPDATE `resources` SET `updated_at` = '2009-09-17 09:20:34', `resource_type` = 'movie' WHERE `id` = 1
---
  def update
    @resource = Resource.find(params[:id])

    respond_to do |format|
      if @resource.update_attributes(params[:resource])